; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v10 ?v4)
             (pred_10 ?v2 ?v6)
             (pred_11 ?v10 ?v6)
             (pred_3 ?v13 ?v10 )
	     (pred_12 ?v10)
             (pred_1 ?v11)
             (pred_6 ?v2)
             (pred_9 ?v6)
             (pred_5 ?v10)
             (pred_4 ?v2)
             (pred_8 ?v10)
             (pred_7 ))



(:action op_5
:parameters (?v12 ?v8 ?v7 ?v9)
:precondition (and (pred_1 ?v12) (pred_1 ?v8) (pred_6 ?v7) (pred_9 ?v9)
          (pred_2 ?v12 ?v8) (pred_10 ?v7 ?v9)
                   (pred_11 ?v8 ?v9) (pred_12 ?v12) 
                   (pred_5 ?v8) (pred_4 ?v7))
:effect (and  (pred_8 ?v8) (not (pred_5 ?v8))))


(:action op_1
:parameters (?v12 ?v3)
:precondition (and (pred_1 ?v12) (pred_1 ?v3)
               (pred_12 ?v12) (pred_2 ?v12 ?v3) (pred_8 ?v3))
:effect (and (pred_12 ?v3) (not (pred_12 ?v12))))

(:action op_2
:parameters (?v12 ?v7)
:precondition (and (pred_1 ?v12) (pred_6 ?v7) 
                  (pred_12 ?v12) (pred_3 ?v7 ?v12) (pred_7 ))
:effect (and (pred_4 ?v7)
   (not (pred_3 ?v7 ?v12)) (not (pred_7 ))))


(:action op_4
:parameters (?v12 ?v1 ?v5)
:precondition (and (pred_1 ?v12) (pred_6 ?v1) (pred_6 ?v5)
                  (pred_12 ?v12) (pred_4 ?v5) (pred_3 ?v1 ?v12))
:effect (and (pred_4 ?v1) (pred_3 ?v5 ?v12)
        (not (pred_4 ?v5)) (not (pred_3 ?v1 ?v12))))

(:action op_3
:parameters (?v12 ?v7)
:precondition (and (pred_1 ?v12) (pred_6 ?v7) 
                  (pred_12 ?v12) (pred_4 ?v7))
:effect (and (pred_7 ) (pred_3 ?v7 ?v12) (not (pred_4 ?v7)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_04 obj_14 obj_11 obj_16 obj_05 obj_20 obj_13 obj_19 obj_08 obj_15 obj_10 obj_02 obj_01 obj_12 obj_09
    obj_06 obj_18
    obj_03 obj_17 obj_21
    )

    (:init
       (pred_7)

       (pred_1 obj_07)
       (pred_1 obj_04)
       (pred_1 obj_14)
       (pred_1 obj_11)
       (pred_1 obj_16)
       (pred_1 obj_05)
       (pred_1 obj_20)
       (pred_1 obj_13)
       (pred_1 obj_19)
       (pred_1 obj_08)
       (pred_1 obj_15)
       (pred_1 obj_10)
       (pred_1 obj_02)
       (pred_1 obj_01)
       (pred_1 obj_12)
       (pred_1 obj_09)
       (pred_9 obj_06)
       (pred_9 obj_18)
       (pred_6 obj_03)
       (pred_6 obj_17)
       (pred_6 obj_21)

       (pred_2 obj_07 obj_16)
       (pred_2 obj_07 obj_04)
       (pred_2 obj_04 obj_05)
       (pred_2 obj_04 obj_14)
       (pred_2 obj_04 obj_07)
       (pred_2 obj_14 obj_20)
       (pred_2 obj_14 obj_11)
       (pred_2 obj_14 obj_04)
       (pred_2 obj_11 obj_13)
       (pred_2 obj_11 obj_14)
       (pred_2 obj_16 obj_19)
       (pred_2 obj_16 obj_05)
       (pred_2 obj_16 obj_07)
       (pred_2 obj_05 obj_08)
       (pred_2 obj_05 obj_20)
       (pred_2 obj_05 obj_04)
       (pred_2 obj_05 obj_16)
       (pred_2 obj_20 obj_15)
       (pred_2 obj_20 obj_13)
       (pred_2 obj_20 obj_14)
       (pred_2 obj_20 obj_05)
       (pred_2 obj_13 obj_10)
       (pred_2 obj_13 obj_11)
       (pred_2 obj_13 obj_20)
       (pred_2 obj_19 obj_02)
       (pred_2 obj_19 obj_08)
       (pred_2 obj_19 obj_16)
       (pred_2 obj_08 obj_01)
       (pred_2 obj_08 obj_15)
       (pred_2 obj_08 obj_05)
       (pred_2 obj_08 obj_19)
       (pred_2 obj_15 obj_12)
       (pred_2 obj_15 obj_10)
       (pred_2 obj_15 obj_20)
       (pred_2 obj_15 obj_08)
       (pred_2 obj_10 obj_09)
       (pred_2 obj_10 obj_13)
       (pred_2 obj_10 obj_15)
       (pred_2 obj_02 obj_01)
       (pred_2 obj_02 obj_19)
       (pred_2 obj_01 obj_12)
       (pred_2 obj_01 obj_08)
       (pred_2 obj_01 obj_02)
       (pred_2 obj_12 obj_09)
       (pred_2 obj_12 obj_15)
       (pred_2 obj_12 obj_01)
       (pred_2 obj_09 obj_10)
       (pred_2 obj_09 obj_12)
       (pred_5 obj_20)
       (pred_5 obj_05)
       (pred_5 obj_19)
       (pred_11  obj_20 obj_06)
       (pred_11  obj_05 obj_18)
       (pred_11  obj_19 obj_18)
       (pred_8 obj_07)
       (pred_8 obj_04)
       (pred_8 obj_14)
       (pred_8 obj_11)
       (pred_8 obj_16)
       (pred_8 obj_13)
       (pred_8 obj_08)
       (pred_8 obj_15)
       (pred_8 obj_10)
       (pred_8 obj_02)
       (pred_8 obj_01)
       (pred_8 obj_12)
       (pred_8 obj_09)

       (pred_10  obj_03 obj_06)
       (pred_10  obj_17 obj_18)
       (pred_10  obj_21 obj_06)
       (pred_3 obj_03 obj_10)
       (pred_3 obj_17 obj_20)
       (pred_3 obj_21 obj_01)
       (pred_12 obj_07)
    )

    (:goal (and
       (pred_3 obj_03 obj_08)
    ))
(:constraints
  (always (not (pred_12 obj_15)))
)
)

; plan
1. (op_1 obj_07 obj_04)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_04)
   goals met: 0 of 1
2. (op_1 obj_04 obj_14)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_14)
   goals met: 0 of 1
3. (op_1 obj_14 obj_11)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_11)
   goals met: 0 of 1
4. (op_1 obj_11 obj_13)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_13)
   goals met: 0 of 1
5. (op_1 obj_13 obj_10)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_10)
   goals met: 0 of 1
6. (op_2 obj_10 obj_03)
   deleted: (pred_3 obj_03 obj_10) (pred_7)
   added: (pred_4 obj_03)
   goals met: 0 of 1
7. (op_1 obj_10 obj_09)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_09)
   goals met: 0 of 1
8. (op_1 obj_09 obj_12)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_12)
   goals met: 0 of 1
9. (op_1 obj_12 obj_01)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_01)
   goals met: 0 of 1
10. (op_1 obj_01 obj_08)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_08)
   goals met: 0 of 1
11. (op_3 obj_08 obj_03)
   deleted: (pred_4 obj_03)
   added: (pred_7) (pred_3 obj_03 obj_08)
   goals met: 1 of 1
